IMAGE_STYLES = [
    "Винтаж",
    "Модерн",
    "Абстрактный",
    "Студия Ghibli (теплая анимационная атмосфера, сказочные и природные мотивы, мягкие оттенки)",
    "Кинематографичный (драматичный свет, интересная композиция, атмосферные детали, эффект пленки)",
    "Минимализм",
    "Поп-арт",
    "Сюрреализм",
    "Футуризм",
    "Ретрофутуризм",
    "Неоновые 80-е (Synthwave, Vaporwave)",
    "Комикс/Графический роман",
    "Детский рисунок"
]

IMAGE_FORMATS = [
    "постер",
    "иллюстрация",
    "обложка",
    "инфографика",
    "открытка",
    "визуальная метафора",
    "баннер",
    "обложка для соцсетей",
    "картина",
    "арт-принт"
]

CATEGORIES = {
    "🏫 Школа": [
        ("Русский язык", "🇷🇺"),
        ("Литература", "📚"),
        ("Математика", "➗"),
        ("История", "🏰"),
        ("Биология", "🌱"),
        ("География", "🗺️"),
        ("Химия", "⚗️"),
        ("Физика", "🔬"),
        ("Английский", "🇬🇧"),
        ("  Обществознание  ", "👥"),
    ],
    "  🕊️ Мир вокруг нас  ": [
        ("Космос", "🚀"),
        ("География", "🌍"),
        ("  Страны и города  ", "🏙️"),
        ("Экология", "♻️"),
        ("Античность", "🏺"),
        ("Животный мир", "🐒"),
        ("Погода и стихии", "🌩️️"),
        ("Тайны океана", "🌊️️"),
    ],
    "🔬 Наука": [
        ("Изобретения", "💡"),
        ("Эксперименты", "🧪"),
        ("Загадки науки", "🧑‍🔬"),
        ("  Знаменитые учёные  ", "👨‍🎓"),
        ("Научные открытия", "⚗️"),
    ],
    "🎨 Культура": [
        ("Праздники мира", "🎉"),
        ("  Искусство и музыка  ", "🎵"),
        ("Магия театра", "🎭"),
        ("Короткие рассказы", "📖"),
        ("Русские сказки", "🐻"),
        ("Сказки мира", "🧞"),
    ],
    "🏆 Спорт": [
        ("Спорт и игры", "🤼"),
        ("Футбол", "⚽"),
        ("  Здоровье и питание  ", "🍏"),
        ("Как работает тело", "🧘🏻‍♀️"),
        ("Игры народов мира", "⛳️"),
    ],

    "🧠 Логика": [
        ("Математика в жизни", "➗"),
        ("История чисел", "🔢"),
        ("Весёлые задачи", "⁉️"),
        ("  Геометрия вокруг  ", "📐"),
        ("Шахматы и логика", "♟"),
        ("  Головоломки  ", "🧩"),
    ],
    "💻 IT": [
        ("Как работает смартфон", "📱"),
        ("Внутри компьютера", "🖥️"),
        ("Интернет простыми словами", "🛜"),
        ("Безопасность в интернете", "🛡️"),
        ("Создание игр", "🎮"),
        ("Умные устройства", "🤖"),
        ("Что такое программирование", "👨🏻‍💻"),
        ("Искусственный интеллект", "⚛" )
    ],
    "🎮 Развлечения": [
        ("Майнкрафт", "⛏️"),
        ("Супер Соник", "⚡"),
        ("Покемоны", "🐣"),
        ("  Гарри Поттер  ", "🪄"),
        ("Комиксы Marvel", "⍟"),
    ],
    "🎲 Случайная тема": [
        ("Русский текст", "🇷🇺"),
        ("  Английский текст  ", "🇬🇧"),
    ],
}

BADGES = {
    200:  "🎖️ Новобранец",
    400:  "🎖️ Искатель приключений",
    600:  "🎖️ Мечтатель",
    800:  "🎖️ Исследователь",
    1000:  "🎖️ Пионер",
    1200:  "🥉 Бронзовый новатор",
    1400:  "🥉 Бронзовый мастер",
    1600:  "🥉 Стремительный бронзовый",
    1800:  "🥉 Бронзовый искатель",
    2000: "🥉 Бронзовый повелитель",
    2200: "🥈 Серебряный стратег",
    2400: "🥈 Серебряный наставник",
    2600: "🥈 Серебряный виртуоз",
    2800: "🥈 Серебряный архитектор",
    3000: "🥈 Серебряный вдохновитель",
    3200: "🥇 Золотой герой",
    3400: "🥇 Золотой покоритель",
    3600: "🥇 Золотой чемпион",
    3800: "🥇 Золотой провидец",
    4000: "🥇 Золотой архитектор",
    4500: "💎 Платиновый визирь",
    5000: "💎 Платиновый магнат",
    5500: "💎 Платиновый феномен",
    6000: "💎 Платиновый алхимик",
    6500: "💎 Платиновый легенда",
    7000: "👑 Королевский повелитель",
    7500: "👑 Император знаний",
    8000: "👑 Верховный мудрец",
    9000: "👑 Властелин судеб",
    10000: "👑 Лорд эпохи",
    15000: "🌌 Космический странник",
}

BADGE_LABELS = {
    "🔸": "Начинающий",
    "🎖️": "Медаль",
    "🥉": "Бронзовый",
    "🥈": "Серебряный",
    "🥇": "Золотой",
    "💎": "Платиновый",
    "👑": "Королевский",
    "🌌": "Космический"
}

def build_display() -> dict:
    """Генерирует словарь DISPLAY для вывода категорий с эмодзи."""
    return {t: f"{emoji} {t}" for cat in CATEGORIES.values() for t, emoji in cat}